#include <stdio.h>

int main()
{
	//===========================单分支，多分支==========================================
	//int age = 10;

	//if (age >= 18)
	//{
	//	printf("成年");
	//	printf("能谈恋爱");//多个语句用框框起来（代码块）
	//}
	//else if (age >= 18 && age <= 28)//不能写 18 <=age <=28，计算机从左往右判断时会出错
	//	printf("青年");
	//else
	//	printf ("青年或壮年");

	//=============================else悬空=======================================

	//if ......
	//	if......

	//	else ......//else 和最近的if匹配

	//============================100以内奇数================================
	//int a = 1;
	//
	//while(a <= 100)
	//{
	//	int b = a % 2;
	//	if ((b % 2) == 1)
	//	{
	//		printf(" %d", a);
	//	}
	//	a++;
	//}

	//==================================switch语句=============================

	//int day = 0;
	//scanf_s("%d", &day);

	//switch (day)
	//{
	//case 1:
	//	printf("星期一") ;//Ctrl + D 复制一行
	//	break;
	//case 2:
	//	printf("星期二") ;
	//	break;
	//case 3:
	//	printf("星期三") ;
	//	break;
	//case 4:
	//	printf("星期四") ;
	//	break;
	//case 5:
	//	printf("星期五") ;
	//	break;
	//case 6:
	//	printf("星期六") ;
	//	break;
	//case 7:
	//	printf("星期七") ;
	//	break;
	// default:
	//  printf("输入错误");//如果输入其他数
	//  break;
	//}

	//===============================================================================
	
	//int a = 1;
	//while (a > 0 && a <= 100000)
	//{
	//	printf(" %d", a);
	//	a++;
	//}
	
	//===============================



	return 0;
}