#include<stdio.h>

//=========================================指针========================================
//int main()
//{
//	int a = 10;
//	int* p = &a; //存放地址的变量叫指针变量（指针）
//	              //存放在指针中的值都被当作地址处理
//	return 0;
//}

//int main()
//{
//	printf("%d\n", sizeof(int*));   //指针长度32位4，64位8
//	printf("%d\n", sizeof(char*));
//	printf("%d\n", sizeof(short*));
//	printf("%d\n", sizeof(float*));
//	printf("%d\n", sizeof(double*));
//
//	return 0;
//}

//=================================指针的类型=======================================
//int main()
//{
//	int a = 999;
//	char* p = &a;
//	*p = 0;        //a是int类型，指针用char保存，导致解引用改变量时只改变了第一个字节
//
//	return 0;
//}

//指针类型也决定了指针+1走的字节（步进）

//======================================野指针====================================

//int main()
//{
//	int* p;
//	*p = 20;   //指针不初始化会让里面放随机值，让其变为野指针。(p = NULL;)解决
//
//	return 0;
//}

//int main()
//{
//	int arr[10] = { 0 };
//	int* p = arr;
//	int i = 0;
//	for (i = 0; i < 12; i++)
//	{
//		p++;   //指针越界访问也会导致出现野指针
//	}
//
//	return 0;
//}

int* test()
{
	int a = 10;  //a会在函数结束后就销毁，空间也就释放了，还给操作系统了

	return &a;
}

int main()
{
	int* p = test();  //返回来的指针包含的地址（空间）已经不属于原来的a了，属于别的程序了
	*p = 20;

	return 0;
}
