#include<stdio.h>

//=======================================数组交换====================================

//int main()
//{
//	int arr1[] = { 1,2,3,4,5,6,7,8,9,10 };
//	int arr2[] = { 11,12,13,14,15,16,17,18,19,20 };
//	int i = 0;
//	int sz = sizeof(arr1) / sizeof(arr1[0]);
//
//	for (i = 0; i < sz; i++)
//	{
//		int tmp = arr1[i];
//		arr1[i] = arr2[i];
//		arr2[i] = tmp;
//	}
//
//	return 0;
//}

//=====================================sizeof=====================================

//int i = 0;
//int main()
//{
//	i--;
//	if (i > sizeof(i))  //为什么打印‘>’，因为sizeof返回一个无符号数，进行比较时，i也转变成无符号数，但i是负数
//	{
//		printf(">");
//	}
//	if (i < sizeof(i))
//	{
//		printf("<");
//	}
//
//	return 0;
//}

//========================================逗号练习==================================

int main()
{
	int a, b, c;
	a = 5;
	c = ++a;
	b = ++c, c++, ++a, a++;
	b += a++ + c;

	printf("%d %d %d", a, b, c);

	return 0;
}