#include<stdio.h>

//====================================== 一、==========================================

//int main()
//{
//	int a[5] = { 1,2,3,4,5 };
//	int* ptr = (int*)(&a + 1); //占空间为20byte,但强制成了int*类型
//	printf("%d,%d\n", *(a + 1), *(ptr - 1)); //所以减一时向前移了四个byte的地址
//
//	return 0;
//}//答案：(2,5)

//======================================步长例题===========================================

//struct Test
//{
//	int Num;
//	char* pcName;
//	short sDate;
//	char cha[2];
//	short sBa[4];
//}*p;

//假设p的值为ex100000。 如下表表达式的值分别为多少 ?
//已知，结构体Test类型的变量大小是20个字节

//int main()
//{
//	p = (struct Test*)0x100000;                //强制放入结构体指针变量p
//	printf("%p\n", p + 0x1);                   //这个地址步长为20
//	printf("%p\n",(unsigned long)p + 0x1);     //把这个地址数强行变为整数，再加1
//	printf("%p\n", (unsigned int*)p + 0x1);    //强制变为整数指针变量，步长改为4
//	return 0;
//}//答案：00100014,00100001,00100004

//===================================大小端例题==========================================

//int main()
//{
//	int a[4] = { 1,2,3,4 };
//	int* ptr1 = (int*)(&a + 1);
//	int* ptr2 = (int*)((int)a + 1);
//	printf("%x,%x", ptr1[-1], *ptr2);
//	return 0; 
//}//答案：4,2000000

//=======================================逗号表达式例题=======================================

//#include <stdio.h>
//int main()
//{
//	int a[3][2] = { (0, 1),(2, 3), (4, 5) };
//	int* p;
//	p = a[0];
//
//	printf("%d\n", p[0]);
//	return 0;
//}//答案：1

//=========================================步长=============================================

//int main()
//{
//	int a[5][5];
//	int(*p)[4];
//	p = a; //a首元素放进去会被截掉一点，p的步长仍然是4
//
//	printf("%p ,%d\n", &p[4][2] - &a[4][2], &p[4][2] - &a[4][2]); //负数注意补码
//
//	return 0;
//}//答案：FFFFFFFC ,-4

//=======================================指针减========================================

//#include <stdio.h>
//int main()
//{
//	int aa[2][5] = { 1,2,3,4,5,6,7,8,9,10 };
//	int* ptr1 = (int*)(&aa + 1);
//	int* ptr2 = (int*)(*(aa + 1));
//
//	printf("%d,%d\n", *(ptr1 - 1), *(ptr2 - 1));
//	return 0;
//}//答案:10,5

//=======================================字符指针====================================

//#include <stdio.h>
//int main()
//{
//	char* a[] = { "work", "at","alibaba" };
//	char**pa = a;
//	pa++;
//	printf("%s\n", *pa);
// 
//	return 0;
//}//答案：at

//===================================多级指针与字符指针===============================

#include <stdio.h>

int main()
{
	char* c[] = { "ENTER", "NEW", "POINT", "FIRST" };
	char** cp[] = { c + 3,c + 2,c + 1,c };
	char*** cpp = cp;

	printf("%s\n", **++cpp);
	printf("%s\n",*--* ++cpp +3); //cpp已经加过一次了，这里再加1
	printf("%s\n", *cpp[-2] + 3); //存在cpp里的 - 2
	printf("%s\n", cpp[-1][-1] + 1);

	return 0;
}//答案：POINT，ER，ST，EW

